Autodesk.Revit.DB.ExportLayerTableIterator.CurrentObject
Gets the item at the current position of the iterator.(Inherited from IEnumerator. Give it another property name to avoid confusing. And make it internal.)

Autodesk.Revit.DB.ExportLayerTableIterator.Current
Gets the item at the current position of the iterator.
Remarks: There is no current item if the iterator has not started yet or has been done.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  There is no current item in the iterator.

Autodesk.Revit.DB.ExportLayerTableIterator.GetValue
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no current item in the iterator.
Since:
2014

Autodesk.Revit.DB.ExportLayerTableIterator.GetKey
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no current item in the iterator.
Since:
2014

Autodesk.Revit.DB.ExportLayerTableIterator.Reset
Resets the iterator to the initial state.
Since:
2014

Autodesk.Revit.DB.ExportLayerTableIterator.IsDone
Identifies if the iteration has completed.
Returns:
True if the iteration has no more items.  False if there are more items to be iterated.
Since:
2014

Autodesk.Revit.DB.ExportLayerTableIterator.MoveNext
Increments the iterator to the next item.
Returns:
True if there is a next available item in this iterator.
False if the iterator has completed all available items.
Since:
2014

Autodesk.Revit.DB.ExportLayerTableIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLayerTableIterator
An iterator to a set of Layer table.
Since:
2014